from keyword_extractor import KeywordExractor

texts = [
    "রাজধানীর ফার্মগেট এলাকায় পিকআপ ট্রাক চালান নাসির উদ্দিন। গতকাল মঙ্গলবার দুপুরে রাজধানীর মিন্টো রোডের ডিবি কার্যালয়ের সামনে তাঁর স্ত্রী বাবলী ছোট ছোট চার কন্যাসন্তান নিয়ে দাঁড়িয়ে ছিলেন। পাশেই অঝোরে কাঁদছিলেন নাসিরের মা রুমেলা আক্তার। তাঁরা জানান, ডিবি পরিচয়ে কয়েকজন গিয়ে বাসা থেকে নাসিরকে তুলে এনেছেন। তাঁরা নাসিরের খোঁজে এসেছেন।",
    "বৈষম্যবিরোধী ছাত্র আন্দোলনের ছয় সমন্বয়ক ঢাকা মহানগর পুলিশের গোয়েন্দা বিভাগের (ডিবি) হেফাজত থেকে এখনো ছাড়া পাননি। তাঁদের এভাবে ‘হেফাজতে’ রাখা নিয়ে প্রশ্ন উঠেছে।",
    "এই লেখার শিরোনামে দুটি প্রশ্ন রয়েছে। এই দুই প্রশ্নের প্রেক্ষাপট ও উত্তর খোঁজার চেষ্টা করা যাক। বাংলাদেশে ভিপিএন বা ভার্চ্যুয়াল প্রাইভেট নেটওয়ার্ক ব্যবহার করা কি অবৈধ বা বেআইনি? এককথায় এর উত্তর হলো না। দেশে এখনো ভিপিএনের ব্যবহার নিষিদ্ধ করা হয়নি। কিংবা প্রযুক্তিগত কারণে এর ব্যবহার বন্ধ করারও উপায় নেই। শিরোনামের দ্বিতীয় অংশটি হচ্ছে ইন্টারনেট দুনিয়ায় যুক্ত থেকে ভিপিএন ব্যবহার কি ঝুঁকিপূর্ণ? এর উত্তরও নেতিবাচক।",
    "খুলনায় কোটা সংস্কার আন্দোলনের সব কর্মসূচি প্রত্যাহার করেছেন আন্দোলনরত শিক্ষার্থীদের সমন্বয়কদের একটি অংশ। গতকাল মঙ্গলবার রাতে খুলনা সার্কিট হাউসে পুলিশের ঊর্ধ্বতন কর্মকর্তা, মেয়র, সংসদ সদস্য ও আওয়ামী লীগ নেতাদের সঙ্গে বৈঠকের পর এ কথা জানান তাঁরা। রাত ১০টা থেকে সাড়ে ১১টা পর্যন্ত ওই বৈঠক হয়। বৈঠকে ১১ জন ছাত্র ও কয়েকজন অভিভাবক উপস্থিত ছিলেন।",

]
extractor = KeywordExractor(input_text_list=texts)
# print(extractor.get_keywords_using_rake())
print(extractor.get_keywords_using_pagerank())